In [13]:
import numpy as np
import pandas as pd

Creating DataFrame

In [14]:
#Using List
student_data = [
    [120,80,15],
    [100,60,10],
    [80,40,5],
    [60,40,4]
]
pd.DataFrame(student_data,columns=['IQ','Marks','Pkg'])

    IQ  Marks  Pkg
0  120     80   15
1  100     60   10
2   80     40    5
3   60     40    4

In [15]:
#Using Dictionary
student_dicts = {
    'name':['Taimoor','Bakhtawar','Amir','Shaheer','Noor','Abubakar'],
    'IQ':[45,56,66,78,0,0],
    'Marks':[56,67,89,45,0,0],
    'Pkg':[21,43,54,65,0,0],
}

students = pd.DataFrame(student_dicts)
students.set_index('name',inplace=True)
students

           IQ  Marks  Pkg
name
Taimoor    45     56   21
Bakhtawar  56     67   43
Amir       66     89   54
Shaheer    78     45   65
Noor        0      0    0
Abubakar    0      0    0

In [16]:
print(std1)
print("......................End......................")
print(student)

NameError: name 'std1' is not defined

In [ ]:
movies = pd.read_csv('E:/courses/Data science/Python-by-mam shradha/Pandas/datasets-session-17/movies.csv')
ipl = pd.read_csv('E:/courses/Data science/Python-by-mam shradha/Pandas/datasets-session-17/ipl-matches.csv')
ipl
movies

NameError: name 'pd' is not defined

Important Attributes Of Data Frame

In [ ]:
#shape
print(ipl.shape)
#dtypes
(movies.dtypes)
#index
print(ipl.index)
print(movies.index)
#column
(ipl.columns)
#values
ipl.values[2]
#info
ipl.info()

(950, 20)
RangeIndex(start=0, stop=950, step=1)
RangeIndex(start=0, stop=1629, step=1)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950 entries, 0 to 949
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               950 non-null    int64
 1   City             899 non-null    object
 2   Date             950 non-null    object
 3   Season           950 non-null    object
 4   MatchNumber      950 non-null    object
 5   Team1            950 non-null    object
 6   Team2            950 non-null    object
 7   Venue            950 non-null    object
 8   TossWinner       950 non-null    object
 9   TossDecision     950 non-null    object
 10  SuperOver        946 non-null    object
 11  WinningTeam      946 non-null    object
 12  WonBy            950 non-null    object
 13  Margin           932 non-null    float64
 14  method           19 non-null     object
 15  Player_of_Match  946 non-null    object
 16  Team1Players     950 non-null    object
 17  Team2Players     950 non-null    object
 18  Umpire1          950 non-null    object
 19  Umpire2          950 non-null    object
dtypes: float64(1), int64(1), object(18)
memory usage: 148.6+ KB

In [ ]:
#Describe
movies.describe()

       is_adult  year_of_release  imdb_rating     imdb_votes
count    1629.0      1629.000000  1629.000000    1629.000000
mean        0.0      2010.263966     5.557459    5384.263352
std         0.0         5.381542     1.567609   14552.103231
min         0.0      2001.000000     0.000000       0.000000
25%         0.0      2005.000000     4.400000     233.000000
50%         0.0      2011.000000     5.600000    1000.000000
75%         0.0      2015.000000     6.800000    4287.000000
max         0.0      2019.000000     9.400000  310481.000000

In [ ]:
#Isnull
movies.isnull().sum()

title_x                0
imdb_id                0
poster_path          103
wiki_link              0
title_y                0
original_title         0
is_adult               0
year_of_release        0
runtime                0
genres                 0
imdb_rating            0
imdb_votes             0
story                 20
summary                0
tagline             1072
actors                 5
wins_nominations     922
release_date         107
dtype: int64

In [ ]:
#Rename
student
student.rename(columns={'Marks':'Percnt','Pkg':'Lpa'})

   IQ  Percnt  Lpa Grade
0  45      56   21    A+
1  56      67   43    A+
2  66      89   54     B
3  78      45   65    C-

In [ ]:
#Dublicated
print(students)
students.duplicated().sum()

   IQ  Marks  Pkg Grade
0  45     56   21    A+
1  56     67   43    A+
2  66     89   54     B
3  78     45   65    C-
4   0      0    0     0
5   0      0    0     0

np.int64(1)

Selecting Col from Data Frame

In [ ]:
#Single Colunm
movies['title_x']

0                   Uri: The Surgical Strike
1                              Battalion 609
2       The Accidental Prime Minister (film)
3                            Why Cheat India
4                            Evening Shadows
                        ...
1624                   Tera Mera Saath Rahen
1625                    Yeh Zindagi Ka Safar
1626                         Sabse Bada Sukh
1627                                   Daaka
1628                                Humsafar
Name: title_x, Length: 1629, dtype: object

In [ ]:
ipl['Venue']

0                Narendra Modi Stadium, Ahmedabad
1                Narendra Modi Stadium, Ahmedabad
2                           Eden Gardens, Kolkata
3                           Eden Gardens, Kolkata
4                        Wankhede Stadium, Mumbai
                          ...
945                                  Eden Gardens
946                              Wankhede Stadium
947                              Feroz Shah Kotla
948    Punjab Cricket Association Stadium, Mohali
949                         M Chinnaswamy Stadium
Name: Venue, Length: 950, dtype: object

In [ ]:
#Multiple Colunms
movies[['title_x','actors','year_of_release']]

,title_x,actors,year_of_release
0,Uri: The Surgical Strike,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...,2019
1,Battalion 609,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...,2019
2,The Accidental Prime Minister (film),Anupam Kher|Akshaye Khanna|Aahana Kumra|Atul S...,2019
3,Why Cheat India,Emraan Hashmi|Shreya Dhanwanthary|Snighdadeep ...,2019
4,Evening Shadows,Mona Ambegaonkar|Ananth Narayan Mahadevan|Deva...,2018
...,...,...,...
1624,Tera Mera Saath Rahen,Ajay Devgn|Sonali Bendre|Namrata Shirodkar|Pre...,2001
1625,Yeh Zindagi Ka Safar,Ameesha Patel|Jimmy Sheirgill|Nafisa Ali|Gulsh...,2001
1626,Sabse Bada Sukh,Vijay Arora|Asrani|Rajni Bala|Kumud Damle|Utpa...,2018
1627,Daaka,Gippy Grewal|Zareen Khan|,2019
1628,Humsafar,Fawad Khan|,2011

In [ ]:
students.iloc[0]

IQ       45
Marks    56
Pkg      21
Name: Taimoor, dtype: int64

In [ ]:
students.iloc[[0,2,3]]

         IQ  Marks  Pkg
name
Taimoor  45     56   21
Amir     66     89   54
Shaheer  78     45   65

In [ ]:
students.iloc[:3]

           IQ  Marks  Pkg
name
Taimoor    45     56   21
Bakhtawar  56     67   43
Amir       66     89   54

In [ ]:
students.loc['Taimoor':'Shaheer']

           IQ  Marks  Pkg
name
Taimoor    45     56   21
Bakhtawar  56     67   43
Amir       66     89   54
Shaheer    78     45   65

Selecting Row and Colunms Both

In [ ]:
students.iloc[0:3,0:3]

           IQ  Marks  Pkg
name
Taimoor    45     56   21
Bakhtawar  56     67   43
Amir       66     89   54

In [ ]:
students.loc[['Taimoor','Shaheer'],['Marks']]

         Marks
name
Taimoor     56
Shaheer     45

In [ ]:
#Here we are filtring the season and winning teams of only final
ipl[ipl['MatchNumber']=='Final'][['Season','WinningTeam']]

      Season            WinningTeam
0       2022         Gujarat Titans
74      2021    Chennai Super Kings
134  2020/21         Mumbai Indians
194     2019         Mumbai Indians
254     2018    Chennai Super Kings
314     2017         Mumbai Indians
373     2016    Sunrisers Hyderabad
433     2015         Mumbai Indians
492     2014  Kolkata Knight Riders
552     2013         Mumbai Indians
628     2012  Kolkata Knight Riders
702     2011    Chennai Super Kings
775  2009/10    Chennai Super Kings
835     2009        Deccan Chargers
892  2007/08       Rajasthan Royals

In [ ]:
new_df=movies[movies['year_of_release']==2019][['year_of_release','title_x','actors']]
new_df.set_index('year_of_release',inplace=True)
new_df

,title_x,actors
year_of_release,,
2019,Uri: The Surgical Strike,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...
2019,Battalion 609,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...
2019,The Accidental Prime Minister (film),Anupam Kher|Akshaye Khanna|Aahana Kumra|Atul S...
2019,Why Cheat India,Emraan Hashmi|Shreya Dhanwanthary|Snighdadeep ...
2019,Fraud Saiyaan,Arshad Warsi|Saurabh Shukla|Flora Saini|Sara L...
...,...,...
2019,Commando 3 (film),Vidyut Jammwal|Adah Sharma|Angira Dhar|Sumeet ...
2019,Mardaani 2,Rani Mukerji|Rajesh Sharma|Shruti Bapna|
2019,Dabangg 3,Salman Khan|Sonakshi Sinha|Sudeep|Mahesh Manjr...
2019,Good Newwz,Akshay Kumar|Kareena Kapoor|Kiara Advani|Tisca...
2019,Daaka,Gippy Grewal|Zareen Khan|

In [ ]:
The= ipl[ipl['SuperOver']=='Y'][['Season','WinningTeam','SuperOver']]
The.set_index('Season')

                         WinningTeam SuperOver
Season
2021                  Delhi Capitals         Y
2020/21        Kolkata Knight Riders         Y
2020/21              Kings XI Punjab         Y
2020/21  Royal Challengers Bangalore         Y
2020/21               Delhi Capitals         Y
2019                  Mumbai Indians         Y
2019                  Delhi Capitals         Y
2017                  Mumbai Indians         Y
2015                 Kings XI Punjab         Y
2014                Rajasthan Royals         Y
2013     Royal Challengers Bangalore         Y
2013             Sunrisers Hyderabad         Y
2009/10              Kings XI Punjab         Y
2009                Rajasthan Royals         Y

In [ ]:
movies[['title_x','actors','genres']].set_index('title_x')

,actors,genres
title_x,,
Uri: The Surgical Strike,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...,Action|Drama|War
Battalion 609,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...,War
The Accidental Prime Minister (film),Anupam Kher|Akshaye Khanna|Aahana Kumra|Atul S...,Biography|Drama
Why Cheat India,Emraan Hashmi|Shreya Dhanwanthary|Snighdadeep ...,Crime|Drama
Evening Shadows,Mona Ambegaonkar|Ananth Narayan Mahadevan|Deva...,Drama
...,...,...
Tera Mera Saath Rahen,Ajay Devgn|Sonali Bendre|Namrata Shirodkar|Pre...,Drama
Yeh Zindagi Ka Safar,Ameesha Patel|Jimmy Sheirgill|Nafisa Ali|Gulsh...,Drama
Sabse Bada Sukh,Vijay Arora|Asrani|Rajni Bala|Kumud Damle|Utpa...,Comedy|Drama
Daaka,Gippy Grewal|Zareen Khan|,Action
Humsafar,Fawad Khan|,Drama|Romance

If You Want Results in Alphabatic Form Just remove Shape[0]

In [ ]:
#Find the winnerteam of only Final Matches
ipl[ipl['MatchNumber']=='Final'].shape[0]

15

In [ ]:
#How many Super Overs are occured
ipl[ipl['SuperOver']=='Y'].shape[0]

14

In [ ]:
#How many matches csk has won in kolkata
ipl[(ipl['City']=='Kolkata')&(ipl['WinningTeam']=='Chennai Super Kings')].shape[0]

5

In [ ]:
#Toss winner is match winner percentage
(ipl[ipl['TossWinner'] == ipl['WinningTeam']].shape[0]/ipl.shape[0])*100

51.473684210526315

In [ ]:
#Movies rating highr than 8 and votes greater than 10000
movies[(movies['imdb_rating']>8) & (movies['imdb_votes']>10000)].shape[0]

43

In [ ]:
#Action movies rating higher than 7.5
mask1=movies['genres'].str.split('|').apply(lambda x:'Action' in x)
mask2=movies['imdb_rating']>7.5
movies[mask1 & mask2][['title_x','genres']].shape[0]

33

In [ ]:
#Number of Winnings of each Team
ipl1 = ipl['WinningTeam']=='Chennai Super Kings'
ipl2 = ipl['WinningTeam']=='Punjab Kings'
print("Chennai Super Kings : ",ipl[ipl1].shape[0])
print("Punjab Kings : ",ipl[ipl2].shape[0])

Chennai Super Kings :  121
Punjab Kings :  13

Adding New Columns

In [ ]:
students['Grade'] = 'A+'
students

           IQ  Marks  Pkg Grade
name
Taimoor    45     56   21    A+
Bakhtawar  56     67   43    A+
Amir       66     89   54    A+
Shaheer    78     45   65    A+
Noor        0      0    0    A+
Abubakar    0      0    0    A+

In [ ]:
movies.dropna(inplace=True)

In [ ]:
movies['LeadActors']=movies['actors'].str.split('|').apply(lambda x:x[0])
movies.sample(3)

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date,LeadActors
733,Housefull 2,tt1980986,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Housefull_2,Housefull 2,Housefull 2,0,2012,145,Action|Comedy|Musical,5.2,12146,Housefull 2 is about the Kapoor family. Daboo ...,A comedy of errors wherein four men help each ...,The Dirty Dozen,Akshay Kumar|John Abraham|Asin|Jacqueline Fern...,10 wins & 6 nominations,5 April 2012 (India),Akshay Kumar
1425,The Bypass,tt0397941,https://upload.wikimedia.org/wikipedia/commons...,https://en.wikipedia.org/wiki/The_Bypass,The Bypass,The Bypass,0,2003,17,Crime|Short,7.6,810,A bypass somewhere in Rajasthan two violent m...,A bypass somewhere in Rajasthan two violent m...,Caution: Men at Work,Nawazuddin Siddiqui|Sundar Dan Detha|Irrfan Kh...,1 win & 1 nomination,August 2003 (UK),Nawazuddin Siddiqui
1490,Devdas (2002 Hindi film),tt0238936,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Devdas_(2002_Hin...,Devdas,Devdas,0,2002,185,Drama|Musical|Romance,7.6,35705,Devdas Mukherji is black-listed by his multi-m...,After his wealthy family prohibits him from ma...,A grand saga of timeless love,Shah Rukh Khan|Aishwarya Rai Bachchan|Madhuri ...,Nominated for 1 BAFTA Film Award,12 July 2002 (India),Shah Rukh Khan

In [ ]:
movies

NameError: name 'movies' is not defined